# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [26]:
#Your code here
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Display the names of all the employees in Boston.

In [27]:
#Your code here
cur.execute('''select firstName, lastName from employees
                join offices
                on employees.officeCode = offices.officeCode
                where city = 'Boston';''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson

## Do any offices have no employees?

In [29]:
#Your code here
cur.execute('''select city, count(*)
                from employees
                left join offices
                using(officeCode)
                group by 1;''')
df = pd.DataFrame(cur.fetchall())
df
#no, all offices have employees

               0  1
0         Boston  2
1         London  2
2            NYC  2
3          Paris  5
4  San Francisco  6
5         Sydney  4
6          Tokyo  2

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary

In [40]:
# Your code here - how many orders for Volkswagen Microbuses were placed? 
cur.execute('''select count(quantityOrdered)
                from orderdetails
                join products
                using(productCode)
                where productname = '1962 Volkswagen Microbus';''')
cur.fetchall()

[(28,)]

In [38]:
# Your code here - what sales rep has the most customers?
cur.execute('''select firstname, lastname, count(customernumber)
                from employees e
                join customers c
                on e.employeeNumber = c.salesrepemployeenumber
                order by 2 desc
                limit 1;''')
cur.fetchall()

[('Martin', 'Gerard', 100)]

In [42]:
# Your code here - how many payments have Toys of Finland, Co. made?
cur.execute('''select count(checkNumber)
                from payments
                join customers
                using(customerNumber)
                where customername = 'Toys of Finland, Co.';''')
cur.fetchall()

[(3,)]

## Level Up: Display the names of each product each employee has sold.

In [47]:
# Your code here
cur.execute('''select firstname, lastname, productname
                from employees e
                join customers c
                on e.employeenumber = c.salesrepemployeenumber
                join orders o
                using(customernumber)
                join orderdetails od
                using(ordernumber)
                join products p
                using(productcode)
                group by firstname, lastname;''')
df = pd.DataFrame(cur.fetchall())
df.head()

          0          1                         2
0      Andy     Fixter          Boeing X-32A JSF
1     Barry      Jones  1960 BSA Gold Star DBD34
2  Foon Yue      Tseng        2002 Yamaha YZR M1
3    George     Vanauf        2002 Yamaha YZR M1
4    Gerard  Hernandez           1982 Camaro Z28

## Level Up: Display the Number of Products each Employee Has sold

In [ ]:
#Your code here

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!